abstractsig/io_stm32f405/io_cpu.h
/*
 *
 * io representation of a stm32f4xx cpu
 *
 */
#ifndef io_cpu_H_
#define io_cpu_H_
#include <io_core.h>
#include <stm32f4xx_peripherals.h>

//
// clocks
//

typedef struct PACK_STRUCTURE stm32f4_crystal_oscillator {
	IO_CPU_CLOCK_SOURCE_STRUCT_MEMBERS
	float64_t crystal_frequency;
} stm32f4_crystal_oscillator_t;

typedef struct PACK_STRUCTURE stm32f4_rc_oscillator {
	IO_CPU_CLOCK_SOURCE_STRUCT_MEMBERS
	float64_t frequency;
} stm32f4_rc_oscillator_t;

typedef struct PACK_STRUCTURE stm32f4_apb_clock {
	IO_CPU_CLOCK_FUNCTION_STRUCT_MEMBERS
	uint32_t divider;
} stm32f4_ahb_clock_t, stm32f4_apb_clock_t;

typedef struct PACK_STRUCTURE stm32f4_pll {
	IO_CPU_CLOCK_FUNCTION_STRUCT_MEMBERS

	uint32_t M;
	uint32_t N;
	uint32_t P;
	uint32_t Q;	// for USB

} stm32f4_pll_t;

typedef struct stm32f4_core_clock {
	IO_CPU_DEPENDANT_CLOCK_STRUCT_MEMBERS
} stm32f4_core_clock_t;

typedef struct stm32f4_peripheral_clock {
	IO_CPU_DEPENDANT_CLOCK_STRUCT_MEMBERS
	void (*enable_apb_clock) (void);
} stm32f4_peripheral_clock_t;

extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_hsi_oscillator_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_hse_oscillator_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_pll_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_core_clock_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_ahb_clock_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb1_clock_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb2_clock_implementation;
extern EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb_peripheral_clock_implementation;

//
// pins
//
typedef union PACK_STRUCTURE {
	io_pin_t io;
	uint32_t u32;
	struct PACK_STRUCTURE {
		uint32_t port_id:4;
		uint32_t number:4;
		uint32_t alternate:4;
		uint32_t active_level:1;
		uint32_t initial_state:1;
		uint32_t function:2;
		uint32_t pull_mode:2;
		uint32_t speed:2;
		uint32_t output_type:1;
		uint32_t pull:2;
		uint32_t :9;
	} stm;
} stm32f4_io_pin_t;

struct stm_gpio_port {
	GPIO_TypeDef *registers;
	void (*enable_clock) (void);
};

extern const struct stm_gpio_port stm_gpio_ports[];

#define stm_gpio_pin_enable_port_clock(pin)		stm_gpio_ports[(pin).stm.port_id].enable_clock()
#define stm_gpio_pin_port(pin)					stm_gpio_ports[(pin).stm.port_id].registers
#define stm_gpio_pin_number(pin)				(pin).stm.number
#define stm_gpio_pin_speed(pin)					(pin).stm.speed
#define stm_gpio_pin_alternate(pin)				(pin).stm.alternate
#define stm_gpio_pin_pull_mode(pin)				(pin).stm.pull_mode
#define stm_gpio_pin_output_type(pin)			(pin).stm.output_type
#define stm_gpio_pin_pull(pin)					(pin).stm.pull
#define stm_gpio_pin_function(pin)				(pin).stm.function

enum {
	STM_GPIO_PORT_A = 0,
	STM_GPIO_PORT_B,
	STM_GPIO_PORT_C,
	STM_GPIO_PORT_D,
};

void configure_stm32f4_io_pin_alternate (stm32f4_io_pin_t);
void configure_stm32f4_io_pin (stm32f4_io_pin_t);


INLINE_FUNCTION void
stm32f4_pin_set_low (stm32f4_io_pin_t pin) {
	stm_gpio_pin_port(pin)->BSRRH = (1 << stm_gpio_pin_number(pin));
}

INLINE_FUNCTION void
stm32f4_pin_set_high (stm32f4_io_pin_t pin) {
	stm_gpio_pin_port(pin)->BSRRL = (1 << stm_gpio_pin_number(pin));
}

//
// sockets
//

typedef struct PACK_STRUCTURE stm32f4_uart {
	IO_SOCKET_STRUCT_MEMBERS

	io_t *io;
	io_encoding_implementation_t const *encoding;
	
	io_encoding_pipe_t *tx_pipe;
	io_event_t signal_transmit_available;
	io_byte_pipe_t *rx_pipe;
	
	io_cpu_clock_pointer_t peripheral_bus_clock;
	USART_TypeDef* uart_registers;
	uint32_t baud_rate;
	IRQn_Type interrupt_number;
	stm32f4_io_pin_t tx_pin;
	stm32f4_io_pin_t rx_pin;

} stm32f4_uart_t;

extern EVENT_DATA io_socket_implementation_t stm32f4_uart_implementation;

#define USART_CR1_CLEAR_MASK ((uint16_t)(USART_CR1_M | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE | USART_CR1_RE))


//
// STM32F4
//

#define STM32F4_IO_CPU_STRUCT_MEMBERS \
	IO_STRUCT_MEMBERS				\
	io_value_memory_t *vm;\
	io_byte_memory_t *bm;\
	uint32_t in_event_thread;\
	io_value_pipe_t *tasks;\
	/**/

typedef struct PACK_STRUCTURE stm32f4xx_io {
	STM32F4_IO_CPU_STRUCT_MEMBERS
} stm32f4xx_io_t;

io_t*	initialise_cpu_io (io_t*);
void	microsecond_delay (uint32_t us);

void const* get_flash_sector_address(uint32_t);
bool flash_write_callback (uint32_t,void (*) (void*,void*),void *);

typedef struct {
	uint8_t data[64];
	uint32_t datalen;
	uint64_t bitlen;
	uint32_t state[8];
} sha256_context_t;

void sha256_init(sha256_context_t *ctx);
void sha256_update(sha256_context_t *ctx, const uint8_t data[], size_t len);
void sha256_final(sha256_context_t *ctx, uint8_t hash[]);

//
// STM32F4 io pins
//

typedef enum {
  ANALOG_CHANNEL_0 = 0,
  ANALOG_CHANNEL_1,
  ANALOG_CHANNEL_2,
  ANALOG_CHANNEL_3,
  ANALOG_CHANNEL_4,
  ANALOG_CHANNEL_5,
  ANALOG_CHANNEL_6,
  ANALOG_CHANNEL_7,
  ANALOG_CHANNEL_8,
  ANALOG_CHANNEL_9,
  ANALOG_CHANNEL_10,
  ANALOG_CHANNEL_11,
  ANALOG_CHANNEL_12,
  ANALOG_CHANNEL_13,
  ANALOG_CHANNEL_14,
  ANALOG_CHANNEL_15,
  ANALOG_CHANNEL_16,
  ANALOG_CHANNEL_17,
} analogue_channel_number_t;

//
// STM32F4 interrupts
//

#define ENABLE_INTERRUPTS			do {__DSB(); __enable_irq();} while (0);
#define DISABLE_INTERRUPTS			do {__disable_irq(); __DSB();} while (0);
#define EVENT_PRIORITY				((1 << __NVIC_PRIO_BITS) - 1)
#define EVENT_THREAD_INTERRUPT	PendSV_IRQn

#define NUMBER_OF_ARM_INTERRUPT_VECTORS	16L
#define NUMBER_OF_INTERRUPT_VECTORS (NUMBER_OF_ARM_INTERRUPT_VECTORS + NUMBER_OF_STM32F4_INTERRUPT_VECTORS)

typedef void (*io_cpu_interrupt_handler_t) (void*);

typedef struct PACK_STRUCTURE interrupt_handler {
	io_cpu_interrupt_handler_t handler;
	void *user_value;
} io_cpu_interrupt_t;

void	unhandled_cpu_interrupt (void*);

#ifndef nmi_cpu_interrupt
# define nmi_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef hard_fault_cpu_interrupt
# define hard_fault_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef memory_manager_cpu_interrupt
# define memory_manager_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef bus_fault_cpu_interrupt
# define bus_fault_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef usage_fault_cpu_interrupt
# define usage_fault_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef service_cpu_interrupt
# define service_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef debug_monitor_cpu_interrupt
# define debug_monitor_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef pending_service_cpu_interrupt
# define pending_service_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef system_tick_cpu_interrupt
# define system_tick_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef uart1_io_cpu_interrupt
# define uart1_io_cpu_interrupt	unhandled_cpu_interrupt
#endif
#ifndef uart3_io_cpu_interrupt
# define uart3_io_cpu_interrupt	unhandled_cpu_interrupt
#endif

