abstractsig/io_stm32f405/io_cpu.h
EVENT_DATA io_cpu_clock_implementation_t stm32f4_ahb_clock_implementation = {
	.specialisation_of = &stm32f4_apb_clock_implementation,
	.get_frequency = stm32f4_apb_clock_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_ahb_clock_start,
	.stop = NULL,
};

static bool
stm32f4_apb1_clock_start (io_t* io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		stm32f4_apb_clock_t const *this = (
			(stm32f4_apb_clock_t const*) io_cpu_clock_ro_pointer (clock)
		);
		bool ok = true;

		// HCLK divider
		switch (this->divider) {
			case 1:
				RCC->CFGR |= RCC_CFGR_PPRE1_DIV1;
			break;
			case 4:
				RCC->CFGR |= RCC_CFGR_PPRE1_DIV4;
			break;

			default:
				ok = false;
			break;
		}

		return ok;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb1_clock_implementation = {
	.specialisation_of = &stm32f4_apb_clock_implementation,
	.get_frequency = stm32f4_apb_clock_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_apb1_clock_start,
	.stop = NULL,
};

static bool
stm32f4_apb2_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		stm32f4_apb_clock_t const *this = (
			(stm32f4_apb_clock_t const*) io_cpu_clock_ro_pointer (clock)
		);
		bool ok = true;

		// HCLK divider
		switch (this->divider) {
			case 1:
				RCC->CFGR |= RCC_CFGR_PPRE2_DIV1;
			break;
			case 2:
				RCC->CFGR |= RCC_CFGR_PPRE2_DIV2;
			break;
			case 4:
				RCC->CFGR |= RCC_CFGR_PPRE2_DIV4;
			break;

			default:
				ok = false;
			break;
		}

		return ok;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb2_clock_implementation = {
	.specialisation_of = &stm32f4_apb_clock_implementation,
	.get_frequency = stm32f4_apb_clock_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_apb2_clock_start,
	.stop = NULL,
};

static float64_t
stm32f4_core_clock_get_frequency (io_cpu_clock_pointer_t clock) {
	stm32f4_core_clock_t const *this = (stm32f4_core_clock_t const*) (
		io_cpu_clock_ro_pointer (clock)
	);
	return io_cpu_clock_get_frequency (this->input);
}

static bool
stm32f4_core_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_cpu_dependant_clock_start_input (io,clock)) {
		stm32f4_core_clock_t const *this = (stm32f4_core_clock_t const*) (
			io_cpu_clock_ro_pointer (clock)
		);
		float64_t new_frequency = io_cpu_clock_get_frequency (this->input);

		if (io_math_compare_float64_ge (new_frequency,168000000.0)) {
			// based on frequency, set WS
			// wait states for 168MHz @ 3.3V
			FLASH->ACR |= FLASH_ACR_LATENCY_5WS;
		} else {
			// need to find the wait state table
		}

		/* Select the main PLL as system clock source */
		RCC->CFGR &= (uint32_t)((uint32_t)~(RCC_CFGR_SW));
		RCC->CFGR |= RCC_CFGR_SW_PLL;

		/* Wait till the main PLL is used as system clock source */
		while ((RCC->CFGR & (uint32_t)RCC_CFGR_SWS ) != RCC_CFGR_SWS_PLL) {
		}

		return true;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_core_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_frequency = stm32f4_core_clock_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_core_clock_start,
	.stop = NULL,
};

static bool
stm32f4_apb_peripheral_clock_start (io_t *io,io_cpu_clock_pointer_t clock) {
	if (io_dependant_cpu_clock_start (io,clock)) {
		stm32f4_peripheral_clock_t const *this = (
			(stm32f4_peripheral_clock_t const*) io_cpu_clock_ro_pointer (clock)
		);
		this->enable_apb_clock();
		return true;
	} else {
		return false;
	}
}

EVENT_DATA io_cpu_clock_implementation_t stm32f4_apb_peripheral_clock_implementation = {
	.specialisation_of = &io_cpu_clock_implementation,
	.get_frequency = io_dependant_cpu_clock_get_frequency,
	.link_input_to_output = NULL,
	.link_output_to_input = NULL,
	.start = stm32f4_apb_peripheral_clock_start,
	.stop = NULL,
};

//
// STM32 UART
//

static void
stm32f4_uart_interrupt_handler (void *user_value) {
	stm32f4_uart_t *this = user_value;
	volatile uint16_t data = this->uart_registers->DR;

	if (io_byte_pipe_put_byte (this->rx_pipe,data)) {
		io_enqueue_event (this->io,io_pipe_event(this->rx_pipe));
	}
}

static void stm32f4_uart_output_event_handler (io_event_t *ev);

static io_socket_t*
stm32f4_uart_initialise (
	io_socket_t *socket,io_t *io,io_socket_constructor_t const *C
) {
	stm32f4_uart_t *this = (stm32f4_uart_t*) socket;
	this->io = io;

	initialise_io_event (
		&this->signal_transmit_available,NULL,this
	);

	
	this->rx_pipe = mk_io_byte_pipe (
		io_get_byte_memory(io),C->receive_pipe_length
	);

	this->tx_pipe = mk_io_encoding_pipe (
		io_get_byte_memory(io),C->transmit_pipe_length
	);

	initialise_io_event (
		io_pipe_event(this->tx_pipe),stm32f4_uart_output_event_handler,this
	);

	register_io_interrupt_handler (
		io,this->interrupt_number,stm32f4_uart_interrupt_handler,this
	);
	
	return socket;
}

static bool
stm32f4_uart_open (io_socket_t *socket) {
	stm32f4_uart_t *this = (stm32f4_uart_t*) socket;

	if (io_cpu_clock_start (this->io,this->peripheral_bus_clock)) {
		if ((this->uart_registers->CR1 & USART_CR1_UE) == 0) {
			float64_t freq = io_cpu_clock_get_frequency (this->peripheral_bus_clock);
			uint32_t baud,temp_reg;

			if ((this->uart_registers->CR1 & USART_CR1_OVER8) != 0) {
				freq /= (float64_t) (8 * 1 * (this->baud_rate));
			} else {
				freq /= (float64_t) (8 * 2 * (this->baud_rate));
			}

			baud = (uint32_t) (floor (freq));
			baud <<= 4;
			if ((this->uart_registers->CR1 & USART_CR1_OVER8) != 0) {
				baud += (uint32_t) ((freq - (floor (freq))) * 8.0);
			} else {
				baud += (uint32_t) ((freq - (floor (freq))) * 16.0);
			}

			this->uart_registers->BRR = (uint16_t) baud;

			configure_stm32f4_io_pin_alternate (this->tx_pin);
			configure_stm32f4_io_pin_alternate (this->rx_pin);

			temp_reg = this->uart_registers->CR2;
			temp_reg &= (uint32_t) ~((uint32_t)USART_CR2_STOP);
			temp_reg |= (uint32_t) USART_StopBits_1;
			this->uart_registers->CR2 = (uint16_t)temp_reg;

			temp_reg = this->uart_registers->CR1;
			temp_reg &= (uint32_t)~((uint32_t) USART_CR1_CLEAR_MASK);
			temp_reg |= (
					8
				|	USART_Parity_No
				|	USART_Mode_Rx
				|	USART_Mode_Tx
			);
			this->uart_registers->CR1 = (uint16_t)temp_reg;
			this->uart_registers->CR3 = 0;

			USART_ITConfig(this->uart_registers,USART_IT_RXNE, ENABLE);
			USART_Cmd(this->uart_registers, ENABLE);

