abstractsig/io_stm32f405/io_cpu.h
/*
static uint8_t ALLOCATE_ALIGN(8) UMM_SECTION_DESCRIPTOR
umm_value_memory_bytes[UMM_VALUE_HEAP_SIZE];
static io_byte_memory_t
umm_value_memory = {
	.heap = (umm_block_t*) umm_value_memory_bytes,
	.number_of_blocks = (UMM_VALUE_HEAP_SIZE / sizeof(umm_block_t)),
};

umm_io_value_memory_t short_term_values = {
	.implementation = &umm_value_memory_implementation,
	.id_ = STVM,
	.bm = &umm_value_memory,
};

//
// success registered value memories
//
io_value_memory_t*
io_get_value_memory_by_id (uint32_t id) {
	if (id == STVM) {
		return (io_value_memory_t*) &short_term_values;
	} else {
		return NULL;
	}
}
*/

#define FLASH_WAIT_LIMIT 		(30000000*20)
#define SECTOR_SIZE	 			0x20000


static inline void
unlock_flash_control_register (void) {
	FLASH->KEYR = 0x45670123;
	FLASH->KEYR = 0xCDEF89AB;
}

bool
flash_wait_for_flash_ready(void) {
	uint32_t count = 0;
	while(FLASH->SR & FLASH_SR_BSY && count < FLASH_WAIT_LIMIT) count++;
	return count < FLASH_WAIT_LIMIT;
}

uint32_t s_sector_map[] = {
	0x08000000,
	0x08004000,
	0x08008000,
	0x0800C000,
	0x08010000,
	0x08020000,	// first 128k sector
	0x08040000,
	0x08060000,
	0x08080000,
	0x080A0000,
	0x080C0000,
	0x080E0000,
};

uint32_t
internal_flash_base_to_sector(uint32_t base) {
	uint32_t s = 0;
	while(s < SIZEOF(s_sector_map)) {
		if (s_sector_map[s] == base) break;
		s++;
	}
	return s;
}

//
// 128k sectors, numbers 5 through 11
//
bool
flash_erase_sector(uint32_t sector) {
	// wait until flash is not busy, can this fail?
	flash_wait_for_flash_ready();

	unlock_flash_control_register();

	FLASH->CR |= (2 << 8);	//set PSIZE to x32
	FLASH->CR |= FLASH_CR_SER;
	FLASH->CR = (FLASH->CR & ~(0x0f << 3)) + ((0x0f & sector) << 3);
	FLASH->CR |= FLASH_CR_STRT;

	flash_wait_for_flash_ready();
	FLASH->CR &= ~FLASH_CR_SER;
	FLASH->CR &= ~(3 << 8);	//set PSIZE to x8
	FLASH->CR |= FLASH_CR_LOCK;

	return 1;
}

//
// write to flash
//
bool
flash_write_callback (uint32_t sector,void (*cb) (void*,void*),void *user_value) {
	if (!(FLASH->CR & FLASH_CR_PG)) {
		void *flash = (void*) (s_sector_map[sector]);

		flash_erase_sector(sector);

		// wait until flash is not busy
		while (FLASH->SR & FLASH_SR_BSY);

		unlock_flash_control_register();
		FLASH->CR |= FLASH_CR_PG;	// enable write

		cb(flash,user_value);

		while (FLASH->SR & FLASH_SR_BSY);
		FLASH->CR &= ~FLASH_CR_PG;
		FLASH->CR |= FLASH_CR_LOCK;

		return true;
	} else {
		return false;
	}
}

void const*
get_flash_sector_address (uint32_t sector) {
	return (void const*) s_sector_map[sector];
}

/****************************** MACROS ******************************/
#define ROTLEFT(a,b) (((a) << (b)) | ((a) >> (32-(b))))
#define ROTRIGHT(a,b) (((a) >> (b)) | ((a) << (32-(b))))

#define CH(x,y,z) (((x) & (y)) ^ (~(x) & (z)))
#define MAJ(x,y,z) (((x) & (y)) ^ ((x) & (z)) ^ ((y) & (z)))
#define EP0(x) (ROTRIGHT(x,2) ^ ROTRIGHT(x,13) ^ ROTRIGHT(x,22))
#define EP1(x) (ROTRIGHT(x,6) ^ ROTRIGHT(x,11) ^ ROTRIGHT(x,25))
#define SIG0(x) (ROTRIGHT(x,7) ^ ROTRIGHT(x,18) ^ ((x) >> 3))
#define SIG1(x) (ROTRIGHT(x,17) ^ ROTRIGHT(x,19) ^ ((x) >> 10))

/**************************** VARIABLES *****************************/
typedef unsigned int  WORD;             // 32-bit word, change to "long" for 16-bit machines

static const WORD k[64] = {
	0x428a2f98,0x71374491,0xb5c0fbcf,0xe9b5dba5,0x3956c25b,0x59f111f1,0x923f82a4,0xab1c5ed5,
	0xd807aa98,0x12835b01,0x243185be,0x550c7dc3,0x72be5d74,0x80deb1fe,0x9bdc06a7,0xc19bf174,
	0xe49b69c1,0xefbe4786,0x0fc19dc6,0x240ca1cc,0x2de92c6f,0x4a7484aa,0x5cb0a9dc,0x76f988da,
	0x983e5152,0xa831c66d,0xb00327c8,0xbf597fc7,0xc6e00bf3,0xd5a79147,0x06ca6351,0x14292967,
	0x27b70a85,0x2e1b2138,0x4d2c6dfc,0x53380d13,0x650a7354,0x766a0abb,0x81c2c92e,0x92722c85,
	0xa2bfe8a1,0xa81a664b,0xc24b8b70,0xc76c51a3,0xd192e819,0xd6990624,0xf40e3585,0x106aa070,
	0x19a4c116,0x1e376c08,0x2748774c,0x34b0bcb5,0x391c0cb3,0x4ed8aa4a,0x5b9cca4f,0x682e6ff3,
	0x748f82ee,0x78a5636f,0x84c87814,0x8cc70208,0x90befffa,0xa4506ceb,0xbef9a3f7,0xc67178f2
};

/*********************** FUNCTION DEFINITIONS ***********************/
void sha256_transform(sha256_context_t *ctx, const uint8_t data[])
{
	WORD a, b, c, d, e, f, g, h, i, j, t1, t2, m[64];

	for (i = 0, j = 0; i < 16; ++i, j += 4)
		m[i] = (data[j] << 24) | (data[j + 1] << 16) | (data[j + 2] << 8) | (data[j + 3]);
	for ( ; i < 64; ++i)
		m[i] = SIG1(m[i - 2]) + m[i - 7] + SIG0(m[i - 15]) + m[i - 16];

	a = ctx->state[0];
	b = ctx->state[1];
	c = ctx->state[2];
	d = ctx->state[3];
	e = ctx->state[4];
	f = ctx->state[5];
	g = ctx->state[6];
	h = ctx->state[7];

	for (i = 0; i < 64; ++i) {
		t1 = h + EP1(e) + CH(e,f,g) + k[i] + m[i];
		t2 = EP0(a) + MAJ(a,b,c);
		h = g;
		g = f;
		f = e;
		e = d + t1;
		d = c;
		c = b;
		b = a;
		a = t1 + t2;
	}

	ctx->state[0] += a;
	ctx->state[1] += b;
	ctx->state[2] += c;
	ctx->state[3] += d;
	ctx->state[4] += e;
	ctx->state[5] += f;
	ctx->state[6] += g;
	ctx->state[7] += h;
}

void sha256_init(sha256_context_t *ctx)
{
	ctx->datalen = 0;
	ctx->bitlen = 0;
	ctx->state[0] = 0x6a09e667;
	ctx->state[1] = 0xbb67ae85;
	ctx->state[2] = 0x3c6ef372;
	ctx->state[3] = 0xa54ff53a;
	ctx->state[4] = 0x510e527f;
	ctx->state[5] = 0x9b05688c;
	ctx->state[6] = 0x1f83d9ab;
	ctx->state[7] = 0x5be0cd19;
}

void sha256_update(sha256_context_t *ctx, const uint8_t data[], size_t len)
{
	WORD i;

	for (i = 0; i < len; ++i) {
		ctx->data[ctx->datalen] = data[i];
		ctx->datalen++;
		if (ctx->datalen == 64) {
			sha256_transform(ctx, ctx->data);
			ctx->bitlen += 512;
			ctx->datalen = 0;
		}
	}
}

void sha256_final(sha256_context_t *ctx, uint8_t hash[])
{
	WORD i;

	i = ctx->datalen;

	// Pad whatever data is left in the buffer.
	if (ctx->datalen < 56) {
		ctx->data[i++] = 0x80;
		while (i < 56)
			ctx->data[i++] = 0x00;
	}
	else {
		ctx->data[i++] = 0x80;
		while (i < 64)
			ctx->data[i++] = 0x00;
		sha256_transform(ctx, ctx->data);
		memset(ctx->data, 0, 56);
	}

	// Append to the padding the total message's length in bits and transform.
	ctx->bitlen += ctx->datalen * 8;
	ctx->data[63] = ctx->bitlen;
	ctx->data[62] = ctx->bitlen >> 8;
	ctx->data[61] = ctx->bitlen >> 16;
	ctx->data[60] = ctx->bitlen >> 24;
	ctx->data[59] = ctx->bitlen >> 32;
	ctx->data[58] = ctx->bitlen >> 40;
	ctx->data[57] = ctx->bitlen >> 48;
	ctx->data[56] = ctx->bitlen >> 56;
	sha256_transform(ctx, ctx->data);

